[
    {
        "title": "SpendZero",
        "imgPath": "spendzero",
        "videoPath": "https://youtu.be/khEkwbzHylA",
        "initialDescription": "Web application for personal financial control with secure authentication and a modern interface, built with Go and React.js",
        "github": "https://github.com/gabrielscholze-r/SpendZero",
        "advancedDescription": "SpendZero is a web application for personal finance management, developed as a learning project using Golang and React.js. The app allows users to register and track their income and expenses easily and securely, providing an intuitive view of spending through both tables and various charts built with the Recharts library."
    },
    {
        "title": "AppNotas",
        "imgPath": "notes",
        "videoPath": "",
        "initialDescription": "Minimalist notes app with text editor, built with React (frontend), Node.js (backend), and MongoDB.",
        "github": "https://github.com/gabrielscholze-r/AppNotas/tree/master",
        "advancedDescription": "AppNotas is a full-stack notes management app that uses React on the frontend, Node.js with Express on the backend, and MongoDB for data storage. It offers features such as note creation, editing, and deletion, smart search, category organization, secure authentication, and an integrated text editor. It stands out for its RESTful API implementation, state management with Context API, modular architecture, and real-time updates. The project is available on GitHub for community contributions."
    },
    {
        "title": "CodeCracker (SwiftUI)",
        "imgPath": "codecracker",
        "videoPath": "https://youtu.be/CteMBizjayQ",
        "initialDescription": "Trivia game for iOS aimed at programming beginners, developed in SwiftUI using a reactive approach.",
        "github": "https://github.com/gabrielscholze-r/Codecracker-SwiftUI/tree/master",
        "advancedDescription": "CodeCracker is an educational iOS application that combines trivia and hands-on programming challenges in an accessible format for beginners. Focused on teaching fundamental concepts in a fun way, the project includes basic exercises with operators, variables, and simple conditionals to introduce syntax intuitively. It features a scoring system with persistent ranking (via Core Data), an interactive map (using MapKit) showing the historical origins of programming languages, and a responsive interface built with SwiftUI."
    },
    {
        "title": "Exoplanet Finder",
        "imgPath": "exoplanet",
        "videoPath": "",
        "initialDescription": "Group project for completing the Bachelor's degree in Computer Science, developed with Angular (frontend) and Flask (backend) for analyzing potential exoplanet data.",
        "github": "https://github.com/gabrielscholze-r/Exoplanet-Finder-Web",
        "advancedDescription": "Capstone project for a Bachelor's degree in Computer Science. The project involved data analysis using information gathered by space satellites such as TESS, Kepler, and K2, analyzing light curves from stars to identify potential exoplanets. A data visualization platform was built in Angular, featuring a responsive interface with multilingual support, and a Flask API integrated with machine learning models to generate graphs based on predictions derived from the provided data."
    },
    {
        "title": "Academic Management",
        "imgPath": "backend",
        "videoPath": "https://youtu.be/RrrRUrWD8e8",
        "initialDescription": "Academic system in Kotlin (Spring Boot/JWT) with admin/user roles and course CRUD functionality",
        "github": "https://github.com/gabrielscholze-r/AuthserverKotlinSpring",
        "advancedDescription": "This project is a Kotlin backend for academic management, developed with Spring Boot and JWT authentication for a Backend Development course during my Postgraduate program. Its main goal is to manage courses, classes, and users securely and scalably, following clean architecture principles. The API provides full CRUD operations, entity relationships, and flexible filtering. The system includes strong security using JWT tokens, SHA-256 encryption, and role-based access control (admin for full access and user for basic operations). The layered architecture (controller, service, repository) ensures easy maintenance and extensibility. Highlights include custom exception handling, real-time data validation, and clear API documentation."
    },
    {
        "title": "GamerTag",
        "imgPath": "gamertag",
        "videoPath": "",
        "initialDescription": "Gamer social network with filters by game genre, friend system, and real-time feed, developed in React + Firebase.",
        "github": "https://github.com/gabrielscholze-r/gamertag-React-/tree/master",
        "advancedDescription": "Class project for a Web Programming course, where I was introduced to React.js. The project is a social network where users can talk about their interests in the gaming world. The app integrates with Firebase for authentication and persistence. Users can add friends, select their favorite game genres, create posts, like and comment, and filter the timeline by genre (e.g., FPS, RPG)."
    },
    {
        "title": "iMóveis",
        "imgPath": "imoveis",
        "videoPath": "",
        "initialDescription": "Administrative system for furniture stores with catalog, shopping cart, and real-time reports, developed in React (frontend), Node.js (backend), and MongoDB",
        "github": "https://github.com/gabrielscholze-r/FurnitureAdministrationSystem/tree/master",
        "advancedDescription": "A complete administrative system for managing furniture stores, developed to optimize operations from product registration to sales analysis. It combines a modern and responsive interface (React.js) with a robust backend (Node.js + MongoDB) to provide essential features for furniture retail, ensuring scalability and ease of use."
    },
    {
        "title": "TapTake E-Sports",
        "imgPath": "taptake",
        "videoPath": "",
        "initialDescription": "Academic project developed to study encryption methods in Java, using a scoring system based on e-sports match results.",
        "github": "https://github.com/gabrielscholze-r/TapTakeE-Sports",
        "advancedDescription": "TapTake E-Sports is an academic project developed in Java to explore encryption techniques applied to scoring systems in e-sports competitions. The project includes a dashboard for ranking visualization and performance analysis, simulating a real environment where sensitive data from games like CS:GO or Valorant needs to be securely handled."
    }
]
