[
  {
    "date": "2025-06-18",
    "title": "English Website",
    "isPortfolioChange": true,
    "tags": ["Portfolio"],
    "description": "Changing portfolio to English",
    "paragraphs": [
      "For a while, I had been thinking about creating an English version of my personal portfolio — mainly because of my job, where I work with English speakers who know nothing about me. Having a website they could visit to learn more about who’s talking to them felt like a good idea.",
      "I considered several ways to implement this change, including adding a language selection menu. But then I realized: most companies expect their employees to have at least some level of English proficiency, whether basic or advanced. So why not just make the entire website in English?",
      "That’s exactly what I did. I started with my résumé, writing out every aspect of my professional background in English. I have to say — it’s been a really valuable experience. I do use translation tools sometimes, since I’m not fully used to writing in English yet, but I’ve definitely noticed improvements in my writing since I started."
    ]
  },
  {
    "date": "2025-04-26",
    "title": "Devlog tab",
    "isPortfolioChange": true,
    "tags": ["Portfolio"],
    "description": "New tab with portfolio changelogs and a devlog of ongoing work",
    "paragraphs": [
      "I decided to add a new tab to my portfolio to share some updates on what I’ve been developing. This way, if someone wants to check it out, they can just go to that tab and get the info.",
      "Initially, the plan was to create a backend in Go and pull publication data from a MongoDB, along with authentication within the portfolio to allow myself to post updates easily. That way, it would be simple to add more devlog events.",
      "However, after implementing the backend and authentication, I ran out of time. So for now, I’ve gone with a simpler approach — using a .json file to store the data.",
      "In addition, I changed the dark mode implementation. Previously, it used only React context, but now it also uses cookies to preserve the user’s preference."
    ]
  },
  {
    "date": "2025-04-17",
    "title": "Deploy & more",
    "isPortfolioChange": true,
    "tags": ["Infrastructure", "Portfolio"],
    "description": "Updated deploy method and not found page",
    "paragraphs": [
      "Previously, the deployment method involved accessing the server where the site is hosted, updating the local repository, and running the build there.",
      "To optimize this and avoid using server processing power for builds, I updated the deployment process. Now, the build is done via GitHub Actions and copied using rsync to the correct folder on the server, replacing the previous project files with the updated ones.",
      "Additionally, I created a page for unknown routes called NotFound.jsx. This file displays a 'page not found' message and redirects the user to the homepage after a few seconds."
    ]
  },
  {
    "date": "2025-04-08",
    "title": "GastoZero - Backend",
    "isPortfolioChange": false,
    "tags": ["Personal Projects"],
    "description": "GastoZero backend completed",
    "paragraphs": [
      "I finished implementing the backend for my GastoZero app. I really liked how Go works — I used a library called Bun that makes working with the database very interactive.",
      "I implemented authentication using JWT, as that's the approach I'm used to for handling this part in the systems I develop outside of work.",
      "One part I particularly enjoyed was setting up a kind of dependency injection to keep the code cleaner. Everything is working fine — now it’s time for the frontend."
    ]
  },
  {
    "date": "2025-04-01",
    "title": "GastoZero - Getting started",
    "isPortfolioChange": false,
    "tags": ["Personal Projects"],
    "description": "Starting a new project - Go + React.js",
    "paragraphs": [
      "I wanted to start a new project to deepen my knowledge of Go by building a backend and to explore styling a React.js app using Tailwind for the first time. My motivation came from my struggle to keep an Excel spreadsheet updated with my expenses — I wanted to build something more solid and interactive to manage my finances better.",
      "The implementation will be done using Go and React.js, with data persistence handled by a PostgreSQL database."
    ]
  }
]
