[
  {
    "date": "2025-04-23",
    "title": "Migração para Twailwind?",
    "isPortfolioChange": true,
    "tags": ["Portfolio"],
    "description": "Futura migração de estilizaçã: Bootstrap + CSS ➡ Tailwind",
    "paragraphs": [
      "A estilização deste portfolio é feita por meio de bootstrap juntamente com arquivos CSS. Porém de uns tempos para cá venho pensando em alterar o jeito que faço os estilos somente para Tailwind, e isso tem motivos",
      "Algo que eu valorizo muito em um site é o quão dinâmico ele é e como ele reage ao usuário, então eu uso muito coisas como o hover para estilização. Porém, utilizando o bootstrap eu não tenho uma opção muito fácil de fazer essa estilização pois o bootstrap não fornece. Portanto, para cada vez que quis utilizar o hover acabei por ter que criar arquivos CSS a rodo, coisa que não gosto muito",
      "Então, por isso, estou fazendo a migração dos estilos para tailwind. Provavelmente será um processo demorado pois tenho que refazer os estilos globais e me acostumar com o tailwind, porém logo mais estará no ar"
    ]
  },
  {
    "date": "2025-04-23",
    "title": "Devlog tab",
    "isPortfolioChange": true,
    "tags": ["Portfolio"],
    "description": "Aba nova com changelogs sobre o portfolio e um devlog sobre o que ando fazendo",
    "paragraphs": [
      "Decidi fazer uma aba nova para meu portfolio que vai descrever um pouco de como anda o desenvolvimento das minhas coisas, assim caso alguém queira dar uma olhada basta entrar nessa aba e terá essa informação.",
      "Inicialmente o plano era fazer um backend em Go e puxar de um MongoDB os dados das publicações, juntamente com autenticação dentro do portfolio para dar a opção de publicação para mim, assim seria tranquilo adicionar mais eventos no devlog.",
      "Porém, após fazer o backend e autenticação, acabei ficando sem tempo então fui para o caminho simples por enquanto, utilizando um .json para armazenar os dados"
    ]
  },
  {
    "date": "2025-04-17",
    "title": "Deploy atualizado & mais",
    "isPortfolioChange": true,
    "tags": ["portfolio"],
    "description": "Método de deploy atualizado e pagina não encontrada",
    "paragraphs": [
      "Anteriormente o método utilizado para deploy era acessar o servidor onde esta o site, atualizar o repósitório local e realizar o build.",
      "Porém, para deixar mais otimizado e não utilizar o processamento do servidor para isso atualizei o deploy. Agora, o build é realizado com o Github Actions e copiado via rsync para a pasta correta no servidor, substituindo os arquivos que tem lá pelos arquivos atuais do projeto",
      "Além disso, construí uma pagina para rotas desconhecidas que chamei de NotFound.jsx. Esse arquivo é responsável por exibir uma mensagem de página não encontrada e redirecionar o usuário para a página inicial da aplicação após alguns segundos"
    ]
  },
  {
    "date": "2025-04-08",
    "title": "GastoZero - Backend",
    "isPortfolioChange": false,
    "tags": ["Outros projetos"],
    "description": "Backend do GastoZero finalizado",
    "paragraphs": [
      "Terminei a implementação do backend do meu aplicativo GastoZero. Achei bem bacana como o Go traballha, utilizei uma biblioteca chamada bun que deixa a parte de mexer com o banco de dados bem interativo",
      "Fiz o sistema de autênticação com JWT, pois é como estou acostumado a fazer essa parte nos sistemas que eu desenvolvo a parte de meu trabalho",
      "Uma parte que achei bacana de fazer foi uma espécie de injeção de dependencia que fiz pra deixar o código menos poluído. Tudo funcionando, agora hora do frontend"
    ]
  },
  {
    "date": "2025-04-01",
    "title": "GastoZero - Inicio",
    "isPortfolioChange": false,
    "tags": ["Outros projetos"],
    "description": "Inicio de um projeto novo - Go + React.js",
    "paragraphs": [
      "Quis iniciar um projeto novo para fazer um estudo mais sólido de Go em uma implementação de backend e estudar pela primeira vez a estilização de um app React.js utilizando Tailwind. Minha motivação veio da minha dificuldade de atualizar constantemente uma planilha do excel com meus gastos e quis fazer algo mais sólido e interativo pra poder me organizar financeiramente",
      "A implementação será feita utilizando Go e React.js, fazendo persistência de dados em um database PostgreSQL"
    ]
  }
]
